8. Rows & Columns Operations in Pandas

In [23]:
import pandas as pd
import numpy as np

In [24]:
import pandas as pd

df = pd.DataFrame({
    "Name": ["Aman","Riya","Kunal","Sneha"],
    "Age": [20,21,22,23],
    "Marks": [78,85,90,70]
})

df

    Name  Age  Marks
0   Aman   20     78
1   Riya   21     85
2  Kunal   22     90
3  Sneha   23     70

PART 1: ADD OPERATIONS

1. Add a NEW COLUMN (MOST COMMON)

In [25]:
# (a) Add a NEW COLUMN (MOST COMMON)
df["city"] = ["delhi","noida","mumbai","delhi"]
df

    Name  Age  Marks    city
0   Aman   20     78   delhi
1   Riya   21     85   noida
2  Kunal   22     90  mumbai
3  Sneha   23     70   delhi

In [26]:
# (B) Column from calculation
df["Result"] = df["Marks"] >= 80
df

    Name  Age  Marks    city  Result
0   Aman   20     78   delhi   False
1   Riya   21     85   noida    True
2  Kunal   22     90  mumbai    True
3  Sneha   23     70   delhi   False

In [27]:
# (C) Column with default value
df["passed"] = "Yes"
df

    Name  Age  Marks    city  Result passed
0   Aman   20     78   delhi   False    Yes
1   Riya   21     85   noida    True    Yes
2  Kunal   22     90  mumbai    True    Yes
3  Sneha   23     70   delhi   False    Yes

In [28]:
# (D) Column using condition
df["Grade"] = "C"
df.loc[df["Marks"]>85,"Grade"] = "A"
df.loc[(df["Marks"]>=75) & (df["Marks"]<85),"Grade"] = "B"
df

    Name  Age  Marks    city  Result passed Grade
0   Aman   20     78   delhi   False    Yes     B
1   Riya   21     85   noida    True    Yes     C
2  Kunal   22     90  mumbai    True    Yes     A
3  Sneha   23     70   delhi   False    Yes     C

2. Add a NEW ROW

In [ ]:
# (A) Using .loc 
df.loc[len(df)] = ["arun",22,88,"pune",True,"Yes","A"]

In [31]:
df

    Name  Age  Marks    city  Result passed Grade
0   Aman   20     78   delhi   False    Yes     B
1   Riya   21     85   noida    True    Yes     C
2  Kunal   22     90  mumbai    True    Yes     A
3  Sneha   23     70   delhi   False    Yes     C
4   arun   22     88    pune    True    Yes     A

In [32]:
# (B) Using concat() (Professional way)
new_row = pd.DataFrame([{
    "Name": "Raghav",
    "Age": 24,
    "Marks": 77,
    "city": "Pune",
    "Result": False,
    "passed": "yes",
    "Grade": "B"
}])

df = pd.concat([df,new_row],ignore_index=True)
df

     Name  Age  Marks    city  Result passed Grade
0    Aman   20     78   delhi   False    Yes     B
1    Riya   21     85   noida    True    Yes     C
2   Kunal   22     90  mumbai    True    Yes     A
3   Sneha   23     70   delhi   False    Yes     C
4    arun   22     88    pune    True    Yes     A
5  Raghav   24     77    Pune   False    yes     B

PART 2: UPDATE OPERATIONS

In [33]:
# Update a COLUMN (entire column)
df["Age"] = df["Age"] + 1
df

     Name  Age  Marks    city  Result passed Grade
0    Aman   21     78   delhi   False    Yes     B
1    Riya   22     85   noida    True    Yes     C
2   Kunal   23     90  mumbai    True    Yes     A
3   Sneha   24     70   delhi   False    Yes     C
4    arun   23     88    pune    True    Yes     A
5  Raghav   25     77    Pune   False    yes     B

In [ ]:
# Update specific rows using condition ( VERY IMPORTANT)
# Increase marks where Marks < 75
df.loc[df["Marks"]<75,"Marks"] = 75

In [35]:
# Add bonus marks to Delhi students
df.loc[df["city"]=="delhi","Marks"] += 1

In [ ]:
# Update single cell
# using loc
df.loc[0,"Marks"] = 90

In [ ]:
# Using iloc
df.iloc[1,3] = "87"

In [42]:
df

     Name  Age  Marks    city  Result passed Grade
0    Aman   21     90   delhi   False    Yes     B
1    Riya   22     87   noida    True    Yes     C
2   Kunal   23     90  mumbai    True    Yes     A
3   Sneha   24     76   delhi   False    Yes     C
4    arun   23     88    pune    True    Yes     A
5  Raghav   25     77    Pune   False    yes     B

PART 3: DELETE OPERATIONS

In [43]:
# Delete a COLUMN
df.drop("Result",axis=1,inplace=True)

In [44]:
df

     Name  Age  Marks    city passed Grade
0    Aman   21     90   delhi    Yes     B
1    Riya   22     87   noida    Yes     C
2   Kunal   23     90  mumbai    Yes     A
3   Sneha   24     76   delhi    Yes     C
4    arun   23     88    pune    Yes     A
5  Raghav   25     77    Pune    yes     B

In [47]:
# Delete multiple columns
df.drop(["passed","Grade"],axis=1,inplace=True)
df

     Name  Age  Marks    city
0    Aman   21     90   delhi
1    Riya   22     87   noida
2   Kunal   23     90  mumbai
3   Sneha   24     76   delhi
4    arun   23     88    pune
5  Raghav   25     77    Pune

In [48]:
# Delete a ROW (by index)
df.drop(1,axis=0,inplace=True)

In [49]:
df

     Name  Age  Marks    city
0    Aman   21     90   delhi
2   Kunal   23     90  mumbai
3   Sneha   24     76   delhi
4    arun   23     88    pune
5  Raghav   25     77    Pune

In [50]:
# Delete rows using condition
df.drop(df[df["Marks"]<80].index,inplace=True)

In [51]:
df

    Name  Age  Marks    city
0   Aman   21     90   delhi
2  Kunal   23     90  mumbai
4   arun   23     88    pune

In [52]:
# Delete rows with missing values
df.dropna(inplace=True)

In [53]:
df

    Name  Age  Marks    city
0   Aman   21     90   delhi
2  Kunal   23     90  mumbai
4   arun   23     88    pune